// 小蓝有30 个数，分别为: 99,22,51,63,72,61,20,88,40,21,63,30,11,1899,12,93,16,7,53,64,9,28,84,34,96,52,82,51,77
// 小蓝可以在这些数中取出两个序号不同的数，共有30x29/2=435种取法
// 请问这435种取法中，有多少种取法取出的两个数的乘积大于等于2022
#include <iostream>
using namespace std;
int main()
{
    int a[30] = {99, 22, 51, 63, 72, 61, 20, 88, 40, 21, 63, 30, 11, 1899, 12, 93, 16, 7, 53, 64, 9, 28, 84, 34, 96, 52, 82, 51, 77};
    int res = 0;
    for (int i = 0; i < 30; i++)
        for (int j = i; j < 30; j++)
        {
            if (a[i] * a[j] >= 2022)
                res++;
        }
    cout << res << endl;
}